/**
 * 테이블에 조각을 게임보드에 채워넣기
 * 1. 회전가능
 * 2. 뒤집는건 안됨
 * 3. 빈칸남으면 안됨 = 딱 맞는 칸
 * @param {*} game_board
 * @param {*} table
 * @returns
 */
function solution(game_board, table) {
  var answer = -1;
  return answer;
}

console.log(
  solution([
    [1, 1, 0, 0, 1, 0],
    [0, 0, 1, 0, 1, 0],
    [0, 1, 1, 0, 0, 1],
    [1, 1, 0, 1, 1, 1],
    [1, 0, 0, 0, 1, 0],
    [0, 1, 1, 1, 0, 0],
  ]),
  [
    [1, 0, 0, 1, 1, 0],
    [1, 0, 1, 0, 1, 0],
    [0, 1, 1, 0, 1, 1],
    [0, 0, 1, 0, 0, 0],
    [1, 1, 0, 1, 1, 0],
    [0, 1, 0, 0, 0, 0],
  ]
);
